{"config": [{"config": {"return_sequences": false, "kernel_regularizer": null, "dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "go_backwards": false, "trainable": true, "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_constraint": null, "use_bias": true, "name": "lstm_1", "return_state": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "stateful": false, "unroll": false, "recurrent_dropout": 0.0, "implementation": 0, "recurrent_activation": "hard_sigmoid", "activation": "sigmoid", "units": 4, "batch_input_shape": [null, null, 1], "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "units": 1, "kernel_constraint": null}, "class_name": "Dense"}], "keras_version": "2.0.6", "class_name": "Sequential", "backend": "tensorflow"}